{
    "id" : "1",
    "level" : "Medium",
    "tags" :["algo", "ambiguity"],
    "date" : "23-Dec-2020",
    "title" : "Designing Unix wc Util",
    "description" : "A walkthrough of how in a simple word count program can be created into a interview question",   
    "body" : "<h3><strong>The Question</strong></h3><p>Implement the Unix wc utility</p><p>OR</p><p>Implement a program to count words in a file</p><h3><strong>The Test</strong></h3><p>The actual test in questions like these is not to test the ability to code but the understand if the candidate can write code in an &ldquo;extensible&rdquo; manner because most FAANGs now have huge codebases and we want our codebases to be easily extensible to new features.</p><h3><strong>The Approaches</strong></h3><p>Usually Senior SDE questions are divided into phases hence its wise to assume that this is just phase 1.</p><p>The bad step here is starting to code something trivial such as counting words out of the file.&nbsp;</p><p><code> while (std::cin &gt;&gt; word) { ++words; } </code></p><p>As an experienced software developer our first goal should always be requirement gathering</p><p>A smart engineer should definitely try to gather the requirements first :</p><ul><li>What is the maximum size of the file we might have to process.</li><li>Are there any tunable or hard memory/resource constraints we have for this process.</li></ul><p>Mostly the answer to both the above question is yes. And it is also very easy to find a partial file reading library in the language of your choice. Eg <a href=\"https://www.baeldung.com/java-read-lines-large-file\">java</a></p><h4><strong>Phase 2</strong></h4><p>Q &ldquo;What if we want to extend the system to support multiple formats, specially encrypted format &ldquo;&nbsp;</p><p>A good candidate should easily be able to to change the design here and implement an OOD where class FileReader now &ldquo;has a&rdquo; decryptorMember.</p><h4><strong>Phase 3</strong></h4><p>Q &ldquo;What if other than reading words we want to also want the functionality count lines?&rdquo;&nbsp;</p><p>Here you can enquire if the interviewer wants to also have the ability of counting occurrences of just new line or wants the user to have the ability to search using regex.</p><p>Incase you have reached these stages then attaching a regex matcher would be pretty close to phase 2 and focus on &ldquo;has a&rdquo; rather than &ldquo;is a&rdquo;.</p><h3><strong>The final comment</strong></h3><p>In this post as you can see it was more important to understand the direction of what we are building rather than giving a quick solution. The more requirements we can gather earlier the more accurate our predictions of the product are going to be.</p><pre><br /><br /></pre>",
    "endText": ""
}